app/Livewire/Pages/Skills/Index.php

    public function render()
    {
		 $skills= Skill::all();
---
select * from `skills`