app/Http/Controllers/SkillController.php

select * from `skills`
---
    public function index()
    {
		 $skills= Skill::all();

insert into `skills` (`name`, `updated_at`, `created_at`) values ('ee', '2024-12-29 07:44:07', '2024-12-29 07:44:07')
---
    public function store(Request $request)
    {

	$request->validate([
            'name' => 'required|string|max:255',
        ]);

        $skill = Skill::create($request->all());

select * from `skills` where `skills`.`id` = '6' limit 1
---
	  public function update(Request $request, $id)
    {
		$request->validate(['name' => 'required|string|max:255']);
        $skill = Skill::findOrFail($id);
        $skill->update($request->all());

select * from `skills` where `skills`.`id` = '7' limit 1
delete from `skills` where `id` = 7
---
	 public function destroy($id)
    {
		$skill = Skill::findOrFail($id);
        $skill->delete();