app/Livewire/Pages/Jobs/Create.php

select * from `skills`
---
    public function render()
    {
		  $skills = Skill::all();