app/Livewire/Pages/Jobs/Index.php

select * from `skills`
---
    public function mount()
    {
	    $skills = Skill::all();

select * from `skills`
---
    public function render()
    {
		$skills = Skill::all();